app/Models/Modeldatafilm.php

SELECT *
FROM `dbfilm`
WHERE `id_film` = '102213'
---
    public function get_data($id) {
		return $this->db
                        ->table('dbfilm')
                        ->where(["id_film" => $id])
                        ->get()
                        ->getRow();

UPDATE `dbfilm` SET `id_film` = '102213', `judul_film` = 'Rudy habibie', `tanggal_rilis` = '2022-07-15', `lama_tayang` = '2022-08-30', `jumlah_penonton` = '12000'
WHERE `id_film` = '102213'
---
	function get_update($id,$data) {
        return $this->db
                        ->table('dbfilm')
                        ->where(["id_film" => $id])
                        ->set($data)
                        ->update();